Vulnerability Test Results/artillery-load-test.yml
type:
  - concurrent
  - http

config:
  target: "https://majestic-pudding-3979e7.netlify.app"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Ramp up load
    - duration: 60
      arrivalRate: 100
      name: Sustained baseline load (100 users)

scenarios:
  - name: "SafeWatch Baseline User Journey"
    flow:
      - get:
          url: "/"
      - think: 1
